Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: You can also expand or collapse all the groups displayed in the Nested Tree view, filter the entries displayed to match any criteria, select the font in which the entries are displayed and display reports of merge, compare, import and other advanced operations.
ru_ru: Кроме того, вы можете свернуть или развернуть все группы в дереве, отфильтровать элементы по какому-либо условию, выбрать шрифт для отображения элементов или просмотреть отчёты о сложных операциях, таких как слияние, сравнение, импорт.

source: You can also hold down the Shift key when clicking on the magnifying glass icon to find the previous match.
ru_ru: То же самое произойдёт, если нажать на кнопку с лупой удерживая клавишу Shift.

source: You can also specify how many passwords to keep.
ru_ru: Также указывается количество сохраняемых паролей.

source: You can also specify some options:
ru_ru: Также можно указать дополнительные параметры:

source: You can also specify the font to use in the Virtual Keyboard.
ru_ru: Кроме того, можно изменить шрифт для экранной клавиатуры.

source: You can also switch between these modes by double-clicking on the R/W / R-O text in the status bar on the bottom of the application's window.
ru_ru: Также, для переключения между этими режимами можно дважды щёлкнуть на надписи R-W (R-0) в строке состояния.

source: You can also use it to minimize the main PasswordSafe window and restore it if already minimized but not locked.
ru_ru: Его можно использовать для сворачивания основного окна Password Safe или его разворачивания, если окно уже свёрнуто, но контейнер не заблокирован.

source: You can always override this for a given entry in the Add Entry or Edit/View Entry dialog boxes.
ru_ru: Данную настройку можно переопределить при добавлении или редактировании элемента.

source: You can change the fields that are displayed in the tree view directly.
ru_ru: Также возможно редактирование полей прямо из древовидного списка.

source: You can change the number of recent passwords that are kept.
ru_ru: Количество сохраняемых предыдущих паролей может быть изменено позже.

source: You can choose to store all your passwords in a single encrypted master password list (an encrypted password database), or use multiple databases to further organize your passwords (work and home, for example).
ru_ru: Для хранения паролей можно создать один список, зашифрованный с использованием мастер-пароля (зашифрованный контейнер), или же разбить их каким-либо образом на несколько групп (например, на домашние и рабочие) и использовать для них отдельные контейнеры с различными мастер-паролями.

source: You can choose whether or not to display a toolbar, and if so, if to use the 'Classic' or 'New Toolbar' icons.
ru_ru: Также здесь можно скрыть или показать панель инструментов и выбрать стиль значков для неё.

source: You can choose whether or not to display a toolbar, and if so, if to use the Classic or New Toolbar Icons.
ru_ru: Также здесь можно скрыть или отобразить панель инструментов и выбрать стиль значков для неё.

source: You can choose whether or not to display a toolbar, and if so, whether to use the 'Classic' or 'New' toolbar icons.
ru_ru: Также здесь можно скрыть или показать панель инструментов и выбрать стиль значков для неё.

source: You can control the following aspects of password history:
ru_ru: На историю паролей влияют следующие параметры:

source: You can create versions of the database that are readable by older versions of Password Safe by explicitly exporting to the desired format (File → Export To and select V1 format... or V2 format...).
ru_ru: Вы можете создать копии контейнера, читаемые в предыдущих версиях Password Safe используя экспорт в требуемый формат (Файл→Экспортировать в, а затем Формат v1.x или Формат v2.x).

source: You can create versions of the database that are readable by older versions of Password Safe by explicitly exporting to the desired format (File > Export To and select V1 format... or V2 format...).
ru_ru: Вы можете создать копии контейнера, читаемые в предыдущих версиях Password Safe используя экспорт в требуемый формат (Файл→Экспортировать в и выберите Формат v1.x или Формат v2.x).

source: You can define a filter for a one-time query, or you can define several filters, naming them and store them persistently, for repeated use.
ru_ru: Вы можете сформировать фильтр для разового использования, или же создать один или несколько именованных фильтров и сохранить их для повторного использования.

source: You can display or hide the password for a specific entry by clicking on the "Show/Hide" button in the dialog.
ru_ru: Вы можете отобразить или скрыть пароль текущего элемента, нажав в диалоге кнопку «Показать/Скрыть».

source: You can do the following operations here:
ru_ru: Допустимы следующие действия:

source: You can specify command line options to the browser via the Browser command line parameters field.
ru_ru: Параметры командной строки для браузера указываются в поле «параметры командной строки».

source: You can specify command line options to the external editor via the external editor command line parameters field.
ru_ru: Параметры командной строки для редактора указываются в поле «параметры командной строки».

source: You can switch between how your entries are shown: either as a single list (Flattened List) or organized by category (Nested Tree).
ru_ru: Здесь можно выбрать режим отображения элементов: в виде простого списка (Простой список) или сгруппированного по категориям (Древовидный список).

source: You can switch between how your entries' user names and passwords are organized: either as a single list (Flattened List) or organized by category (Nested Tree).
ru_ru: Здесь можно выбрать режим отображения элементов: в виде простого списка (Простой список) или сгруппированного по категориям (Древовидный список).

source: You can switch between how your entries' user names and passwords are shown: either as a single list (Flattened List) or organized by category (Nested Tree).
ru_ru: Здесь можно выбрать режим отображения элементов: в виде простого списка (Простой список) или сгруппированного по категориям (Древовидный список).

source: You can toggle this behavior by clicking on the padlock, or via the "Use Secure Desktop for master passphrase" Preference in the Manage → Options... → Security tab, as described here.
ru_ru: Вы можете переключить режим ввода пароля, щёлкнув на значке замка, или изменив параметр "Использовать «Защищённый рабочий стол»" в диалоге Управление→Настройки→Безопасность.

source: You can toggle this behavior by clicking on the padlock, or via the "Use Secure Desktop for master passphrase" Preference in the Manage➙Options...➙Security tab, as described here.
ru_ru: Вы можете переключить режим ввода пароля, щёлкнув на значке замка, или изменив параметр "Использовать «Защищённый рабочий стол»" в диалоге Управление→Настройки→Безопасность.

source: You can use spaces, commas or semi-colons to separate the positions.
ru_ru: В качестве разделителя можно использовать пробелы, запятые и точки с запятой.

source: You may also add the entry keyboard shortcut column to the Flattened List view and/or create a filter to just show those entries with or without keyboard shortcuts.
ru_ru: Также вы можете включить отображение столбца с комбинации клавиш в режиме Простого списка и/или создать фильтр, отображающий только элементы с назначенными горячими клавишами.

source: You may also import a CSV (Comma Separated Values) file exported from Keepass V1 (tested on files created by V1.19b).
ru_ru: Поддерживается импорт CSV-файлов KeePass V1 (проверено на файлах созданных KeePass V1.19b).

source: You may also import a TXT file exported from Keepass V1 (tested on files created by V1.19b).
ru_ru: Поддерживается импорт TXT-файлов KeePass V1 (проверено на файлах созданных KeePass V1.19b).

source: You may also select the Advanced field selection in order to restrict which entries and which fields of these entries you compare between the two databases.
ru_ru: В нём также можно задать расширенные условия отбора, позволяющие ограничить набор элементов и полей для сравнения.

source: You may also select the Advanced field selection in order to restrict which entries and which fields of these entries you synchronize between the two databases.
ru_ru: В нём также можно задать расширенные условия отбора, позволяющие ограничить набор элементов и полей для синхронизации.

source: You may also select the Advanced field selection in order to restrict which entries you export and which field of these entries you export from your current database.
ru_ru: В нём также можно задать расширенные условия отбора, позволяющие ограничить набор элементов и полей для экспорта.

source: You may also select the Advanced field selection in order to restrict which entries you merge into your current database.
ru_ru: В нём также можно задать расширенные условия отбора, позволяющие ограничить набор элементов и полей для слияния с текущим контейнером.

source: You may also select your own set of symbols to use when generating a password containing them.
ru_ru: Также можно указать свой набор символов для создания пароля.

source: You may also select your own set of symbols to use when generating a password contaning them.
ru_ru: Также можно указать свой набор символов для создания пароля.

source: You may also set this list for the whole database via "Manage → Options → Password Policy" tab and override it for specific entries.
ru_ru: Для того, чтобы ваш набор символов использовался по умолчанию, укажите его на вкладке Сервис→Настройки→Политика создания паролей.

source: You may also then copy this to the clipboard.
ru_ru: Полученный пароль можно скопировать в буфер обмена.

source: You may also use environment variables in defining the alternate location for example: "%homedrive%%homepath%\Documents\PWS Backups\".
ru_ru: При указании каталога для резервных копий допускается использование переменных окружения, например «%homedrive%%homepath%\Documents\PWS Backups\».

source: You may also use the change mode menu item further down this menu to switch modes instead of double-clicking on the Status Bar.
ru_ru: Также вы можете переключить режим доступа к контейнеру через это меню.

source: You may choose the option to accept the originally entered (weak) password, or to enter a new one.
ru_ru: Вы можете подтвердить использование введённого «слабого» пароля, или ввести новый пароль.

source: You may create up to 255 named password policies and the name of each of these policies cannot be greater than 255 characters.
ru_ru: Вы можете создать до 255 именованных политик создания паролей, имя каждой из которых не превосходит 255 символов.

source: You may create up to 255 named password policies.
ru_ru: Вы можете создать до 255 именованных политик.

source: You may double click on the keyboard shortcut in this list to Edit/View the corresponding entry.
ru_ru: Для просмотра/редактирования связанного элемента щёлкните дважды на назначенной комбинации.

source: You may need to enclose the result in quotes in your Run Command for correct execution.
ru_ru: Для корректного выполнения команды может потребовать заключение переменной в кавычки.

source: You may not change the name of an existing Named Password Policy.
ru_ru: Имя существующей политики не может быть изменено.

source: You may now use environment variables in defining the alternate location for example: "%homedrive%%homepath%\Documents\PWS Backups\".
ru_ru: При указании каталога для резервных копий допускается использование переменных окружения, например «%homedrive%%homepath%\Documents\PWS Backups\».

source: You may select the database default password policy, a named password policy or use a specific policy you enter into dialog.
ru_ru: Для создания пароля вы можете выбрать политику по умолчанию, именованную политику, или явно задать требуемые параметры.

source: You may select the default or any defined Named Password Policy and click the Test button to create a random password using its rules.
ru_ru: Вы можете выбрать политику по умолчанию или любую другую именованную политику, а затем нажать кнопку «Создать».

source: You may the option to accept the originally entered (weak) password, or to enter a new one.
ru_ru: Вы можете подтвердить использование введённого «слабого» пароля, или ввести новый пароль.

source: You may then export this to either a TXT or CSV file and imported as described above.
ru_ru: После этого можно экспортировать данные в TXT- или CSV-формат и импортировать их как описано выше.

source: You may use the Undo and Redo buttons (or the shortcuts Ctrl+Z and Ctrl+Y [or the equivalent ones if you have changed them via the "Manage → Options" Shortcut property page]) to Undo any changes you have made on this dialog e.g. changed the policy values of the database default policy or a Named Password Policy, added a new or deleted an unused Named Password Policy.
ru_ru: Для отмены/повтора изменений в политиках создания паролей вы можете использовать кнопки «Вернуть» и «Повторить» соответственно (или комбинации клавиш Ctrl+Z и Ctrl+Y [или их эквиваленты, определённые на вкладке «Сервис→Настройки→Комбинации клавиш»]).

source: You may view these reports at a later date when you open a database in this same directory.
ru_ru: Отчёты можно просмотреть позже, если контейнер останется в том же каталоге.

source: You may want to decrease it (make it faster) if you've a fast PC, or increase it (slow it down) for an older machine.
ru_ru: Но вы можете уменьшить его (сделать автонабор быстрее), если у вас мощный компьютер, или, наоборот, увеличить (замедлить автонабор) для старых машин.

source: You may, however, View both the default and other policies.
ru_ru: Просмотр параметров существующих политик доступен в любом режиме.

source: You might also want to set the Double-Click Action for this entry to "Run Command"
ru_ru: Также может оказаться удобным изменить «Действие по двойному клику» для этого элемента на «Выполнить команду».

source: You see the recent passwords associated with the entry.
ru_ru: В списке отображаются предыдущие пароли для указанного элемента.

source: You should also provide the character to be used to denote a line break in the Notes field so that it can be correctly processed when imported.
ru_ru: Чтобы в последующем файл можно было корректно импортировать, нужно указать символ, используемый для разрыва строк в заметках.

source: You should enter the current master password, and then the new master password (twice, for confirmation).
ru_ru: Здесь необходимо ввести текущий мастер-пароль, а затем, новый пароль (вводится дважды, для подтверждения).

source: You will also be able to restrict which fields are Compared, Synchronized or Exported.
ru_ru: Таким образом вы также сможете ограничить список полей для сравнения, синхронизации или экспорта.

source: You will also be able to restrict which fields are examined.
ru_ru: Вы также можете ограничить список полей для рассмотрения.

source: You will also be required to provide a new passphrase for the new Password Safe database.
ru_ru: Также потребуется указать пароль для нового контейнера Password Safe.

source: You will also be required to supply the name of the new file and to confirm overwriting of it if a file of the same name if it already exists in the directory you specified.
ru_ru: Затем будет предложено указать имя нового файла. Если такой файл уже существует, будет выдан запрос о его перезаписи.

source: You will be asked to choose the name and location of your password database (the default, "pwsafe.psafe3", is fine).
ru_ru: Вам будет предложено указать каталог и имя файла для нового контейнера.

source: You will be asked to enter the master password (safe combination) to confirm that you may export the database into a clear text unencrypted file before you can export its contents.
ru_ru: Для подтверждения экспорта данных в незащищённый текстовый файл, будет запрошен мастер-пароль.

source: You will be asked to enter the master password or safe combination to confirm that you may export the database into a clear text unencrypted file before you can export its contents.
ru_ru: Для подтверждения экспорта данных в простой текст будет запрошен мастер-пароль.

source: You will be prompted to "Save" the database and give it a name if you have not saved it prior to exiting the application.
ru_ru: Перед выходом из приложения будет предложено сохранить контейнер, если вы не сделали этого ранее.

source: You will first be asked to enter the master password or safe combination to confirm that you may export the database into a clear text unencrypted file.
ru_ru: Для подтверждения экспорта данных в простой текст будет запрошен мастер-пароль.

source: You will get an expiration notice starting on January 6th.
ru_ru: Напоминания об истечении срока будут выводиться начиная с 6 января.

source: You will then be asked to supply the name of the new file and to confirm overwriting a file of the same name if it already exists in the directory you specified.
ru_ru: Затем будет предложено указать имя нового файла. Если такой файл уже существует, будет выдан запрос о его перезаписи.

source: Your YubiKey needs to be configured properly in order to work with Password Safe.
ru_ru: Перед началом работы YubiKey должен быть настроен для взаимодействия с Password Safe.

source: Your YubiKey's Serial Number should be displayed.
ru_ru: В нём вы должны увидеть серийный номер вашего устройства.

source: Your backup YubiKey's Serial Number should be displayed.
ru_ru: В нём вы должны увидеть серийный номер вашего резервного устройства.

source: Your choices are as follows:
ru_ru: Можно выбрать одно из следующих действий:

source: YubiKey Configuration
ru_ru: Настройки YubiKey

source: YubiKeys can be purchased online from here.
ru_ru: Его можно приобрести в интернет-магазине Yubico.

source: [ssh] will achieve the same effect.
ru_ru: Приставка «[ssh]» оказывает тот же эффект.

source: \$ (escaping $)
ru_ru: \$ (экранирование «$»)

source: \\ (escaping '\')
ru_ru: \\ (экранирование символа «\»)

source: \\{ (escaping \)
ru_ru: \\{ (экранирование «\»)

source: _AutoType_
ru_ru: Autotype (автонабор)

source: _Autotype_
ru_ru: Autotype (автонабор)

source: _Created Time_
ru_ru: Created Time (время создания)

source: _DCA_
ru_ru: DCA (действие по двойному клику)

source: _Group/Title_
ru_ru: Group/Title (группа/заголовок)

source: _History_
ru_ru: History (история)

source: _Last Access Time_
ru_ru: Last Access Time (время последнего доступа)

source: _Notes_
ru_ru: Notes (заметки)

source: _Password Expiry Date_
ru_ru: Password Expiry Date (дата истечения пароля)

source: _Password Expiry Interval_
ru_ru: Password Expiry Interval (срок действия пароля)

source: _Password Modified Time_
ru_ru: Password Modified Time (время изменения пароля)

source: _Password Policy_
ru_ru: Password Policy (политика создания паролей)

source: _Password_
ru_ru: Password (пароль)

source: _Protected Status_
ru_ru: Protected Status (защита элемента)

source: _Protected_
ru_ru: Protected (защита элемента)

source: _Record Modified Time_
ru_ru: Record Modified Time (время изменения записи)

source: _Run Command_
ru_ru: Run Command (выполнить команду)

source: _Run command_
ru_ru: Run Command (выполнить команду)

source: _Shift+DCA_
ru_ru: Shift+DCA (действие по Shift+двойной клик)

source: _Symbol list for password generation_
ru_ru: Symbol list for password generation (список символов для создания паролей)

source: _Symbols_
ru_ru: Symbols (набор символов для создания пароля)

source: _Title_
ru_ru: Title (заголовок)

source: _URL_
ru_ru: URL (ссылка)

source: _Username_
ru_ru: Username (имя пользователя)

source: _e-mail_
ru_ru: e-mail (электронная почта)

source: a or autotype
ru_ru: a или autotype

source: backups tab
ru_ru: вкладка «Резервные копии»

source: body - followed by text to appear in the body of the message.
ru_ru: body — значение, указанное после знака «=», будет помещено в тело письма.

source: by deselecting this option, Password Safe will no longer paste anything into the clipboard during this action.
ru_ru: После снятия флажка Password Safe перестанет помещать пароль в буфер обмена при переходе по ссылке.

source: character string - old password>
ru_ru: строка символов — пароль, сохранённый в истории.

source: character string old password
ru_ru: строка символов — пароль, сохранённый в истории.

source: create search report
ru_ru: создание отчёта о поиске

source: creating complex passwords
ru_ru: Создание сложных паролей

source: database
ru_ru: контейнер

source: dd
ru_ru: дд

source: ddd
ru_ru: ддд

source: ddd : 3 hexadecimal digits : password minimum number of digit characters
ru_ru: ddd — 3 шестнадцатеричные цифры: минимальное количество цифр;

source: ddd MMM dd hh:mm:ss yyyy
ru_ru: ддд МММ дд чч:мм:сс гггг

source: depending on the prefix (see notes above)
ru_ru: в зависимости от префикса (см. выше)

source: e or email
ru_ru: e или email

source: e-mail
ru_ru: e-mail (электронная почта)

source: e.g., 2007-01-26T19:31:25
ru_ru: например, 2007-01-26T19:31:25

source: e.g., 2007-01-26T19:31:25+01:00
ru_ru: например, 2007-01-26T19:31:25+01:00

source: e.g., 2007-01-26T19:31:25Z
ru_ru: например, 2007-01-26T19:31:25Z

source: e.g., 2007/01/26 19:31:25
ru_ru: например, 2007/01/26 19:31:25

source: e.g., Fri Jan 26 19:31:25 2007
ru_ru: например, Вск Окт 31 19:31:25 2010

source: example1
ru_ru: пример 1

source: example2
ru_ru: пример 2

source: example3
ru_ru: пример 3

source: ffff : 4 hexadecimal digits representing the following flags
ru_ru: ffff — 4 шестнадцатеричные цифры, являющиеся комбинацией флагов:

source: file menu
ru_ru: Меню «Файл»

source: g or group
ru_ru: g или group

source: help menu
ru_ru: Меню «Помощь»

source: hh
ru_ru: чч

source: how many passwords to keep in history
ru_ru: Количество паролей, сохраняемых в истории

source: ith line of the Notes field counting from the end, i.e. i=1 is the last line, i=2 means the penultimate line etc.
ru_ru: i-я строка заметок, считая с конца: i=1 — последняя строка, i=2 — предпоследняя и т. д.

source: ith line of the Notes field counting from the end, i.e., i=1 is the last line, i=2 means the penultimate line etc.
ru_ru: i-я строка заметок, считая с конца: i=1 — последняя строка, i=2 — предпоследняя и т. д.

source: ith line of the Notes field counting from the start, i.e. i=1 is the first line, i=2 means the second line etc.
ru_ru: i-я строка заметок, считая с начала: i=1 — первая строка, i=2 — вторая и т. д.

source: ith line of the Notes field counting from the start, i.e., i=1 is the first line, i=2 means the second line etc.
ru_ru: i-я строка заметок, считая с начала: i=1 — первая строка, i=2 — вторая и т. д.

source: if NNN is larger than the number of lines in the notes field, then this has no effect.
ru_ru: если NNN превышает количество строк в поле «заметки», то последовательность игнорируется.

source: if NNN is larger than the number of lines in the notes field, then this has no effect and no lines from the Notes field are copied.
ru_ru: если NNN превышает количество строк в поле «заметки», то последовательность игнорируется;

source: if NNN is zero then all lines are copied i.e. \o0 is equivalent to \o.
ru_ru: если NNN равно нулю, то копируются все строки, то есть \o0 равносильно \o;

source: if you want to put in a one-time delay that does not affect the speed of the following characters, use '\w' or '\W', as described below.
ru_ru: Если требуется вставить однократную задержку, не влияющую на скорость ввода символов, используйте управляющие последовательности «\w» и «\W», описанные ниже.

source: images%5Ccombo_change.jpg
ru_ru: images/combo_change.jpg

source: images%5Cexport.jpg
ru_ru: images/export.jpg
